#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_admin_team.github_team.team_jab: Refreshing state... [id=6937513]
module.github_repos.github_repository.repo_creation[0]: Refreshing state... [id=escape-room-revamp-api]
module.github_admin_team.github_team_members.add_team_to_group: Refreshing state... [id=6937513]
module.github_repos.github_repository_collaborator.brendon_admin[0]: Refreshing state... [id=escape-room-revamp-api:BrendonLH]
module.github_repos.github_repository_collaborator.jin_admin[0]: Refreshing state... [id=escape-room-revamp-api:jinwoov]
module.github_repos.github_branch_protection_v3.repo_governance[0]: Refreshing state... [id=escape-room-revamp-api:main]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github_repos.github_branch_protection_v3.repo_governance[0] must be replaced
-/+ resource "github_branch_protection_v3" "repo_governance" {
      ~ etag                            = "W/\"9642e49968047dcfbf1b00d5259c25828fc4592f926b6c8524f89d5c62aa5c90\"" -> (known after apply)
      ~ id                              = "escape-room-revamp-api:main" -> (known after apply)
      ~ repository                      = "escape-room-revamp-api" -> "angular-practice" # forces replacement
        # (4 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_users                 = [] -> null
          - include_admins                  = false -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.github_repos.github_repository.repo_creation[0] will be updated in-place
  ~ resource "github_repository" "repo_creation" {
      ~ gitignore_template          = "Go" -> "Node"
        id                          = "escape-room-revamp-api"
      ~ name                        = "escape-room-revamp-api" -> "angular-practice"
        # (31 unchanged attributes hidden)
    }

  # module.github_repos.github_repository_collaborator.brendon_admin[0] must be replaced
-/+ resource "github_repository_collaborator" "brendon_admin" {
      ~ id                          = "escape-room-revamp-api:BrendonLH" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ repository                  = "escape-room-revamp-api" -> "angular-practice" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.github_repos.github_repository_collaborator.jin_admin[0] must be replaced
-/+ resource "github_repository_collaborator" "jin_admin" {
      ~ id                          = "escape-room-revamp-api:jinwoov" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ repository                  = "escape-room-revamp-api" -> "angular-practice" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jinwoov, Action: `pull_request`, Working Directory: ``, Workflow: `tf_deploy`*